Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetUseBuiltInMatchingForCategories
Get the categories that utilize specialized matching.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetUseBuiltInMatchingForCategories(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,System.Boolean})
Set the categories that utilize specialized matching.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetPartitioningParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Parameters used for partitioning elements in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetPartitioningParameters
Parameters used for partitioning elements in this schema.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetFormatting(Autodesk.Revit.DB.NumberingFormatSettings)
Set configuration for formatting
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetFormatting
Get configuration for formatting

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetMatchingParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Parameters used for matching elements in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetMatchingParameters
Parameters used for matching elements in this schema.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Categories that will be used with this NumberingSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetCategories
Categories used with this NumberingSchema.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetNumberingOutputParameter(Autodesk.Revit.DB.NumberingParameter)
Sets the output param
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetNumberingOutputParameter
Gets the output param

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.MatchGeometry
True if the geometry is used for matching.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Enabled
Is NumberingSchema enabled.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.OldName
NumberingSchema name as it was before the settings were updated.
Remarks:
This member is not used in the determination of equallity for this object.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Name
NumberingSchema name.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Priority
NumberingSchema priority.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.#ctor
Create an empty AdvancedNumberingSchemaSettings object.

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings
A class containing the settings related to a NumberingSchema object.